array = [
[10100400,101004048],#M416突击步枪->M416-风花雪月
[28100400,100404601],#M416突击步枪默认枪口->M416-风花雪月(枪口)
[29100400,100404602],#M416突击步枪默认弹匣->M416-风花雪月(弹匣)
[20300800,100404603],#M416机械瞄具->M416-风花雪月(机瞄)
[205005,100404604],#M416默认枪托->M416-风花雪月(枪托)
[20500200,100404604],#战术枪托(步枪,冲锋枪,机枪)->M416-风花雪月(枪托)
[20300100,100404611],#红点瞄准镜->M416-风花雪月（红点瞄准镜)
[20301400,100404614],#三倍瞄准镜->M416-风花雪月(3倍镜)
[20300400,100404615],#四倍瞄准镜->M416-风花雪月(4倍瞄准镜)
[20301500,100404616],#六倍瞄准镜->M416-风花雪月(6倍瞄准镜)
[20401100,100404620],#扩容弹夹(步枪,机枪)->M416-风花雪月(扩容弹匣)
[20401200,100404618],#快速弹匣(步枪,机枪)->M416-风花雪月(快速弹匣)
[20401300,100404619],#快速扩容弹匣(步枪,机枪)->M416-风花雪月(快速扩容弹匣)
[20409100,100404620],#扩容弹匣(步枪,机枪)->M416-风花雪月(扩容弹匣)
[20409200,100404618],#快速弹匣(步枪,机枪)->M416-风花雪月(快速弹匣)
[20409300,100404619],#快速扩容弹匣(步枪,机枪)-> M416-风花雪月(快速扩容弹匣)
[20500200,100404630],#战术枪托(步枪,冲锋枪,机枪)->M416-风花雪月(战术枪托)
[20200700,100404622],#激光瞄准器->M416-风花雪月(激光瞄准器)
[20200400,100404623],#轻型握把->M416-风花雪月(轻型握把)
[20200200,100404624],#垂直握把->M416-风花雪月(垂直握把)
[20100900,100404627],#枪口补偿器(步枪)->M416-风花雪月(枪口补偿器)
[20101000,100404628],#消焰器(步枪)->M416-风花雪月(消焰器)
[20101100,100404629],#消音器(步枪)->M416-风花雪月(消音器)
[10100100,101001018],#AKM突击步枪->AKM-甜心宝贝
[29100100,100101702],#AKM突击步枪默认弹匣->AKM-甜心宝贝(弹匣)
[10100200,101002039],#M16A4突击步枪  -  M16A4-晶梦幻蝶
[10100300,101003022],#SCAR-L突击步枪  -  SCAR-L-梦幻火箭
[10100500,101005018],#GROZA突击步枪  -  GROZA-香水柠檬
[10100600,101006053],#AUG突击步枪  -  AUG-星梦奇缘
[10100700,101007006],#QBZ突击步枪  -  QBZ-潮汐统领
[10100800,101008070],#M762突击步枪  -  M762-鬼刀
[10100900,101009003],#Mk47突击步枪  -  Mk47-林间仙鹿
[10101000,101010003],#G36C突击步枪  -  G36C-雪国精灵
[10101100,101011003],#AC-VAL突击步枪  -  AC-VAL-灵感创作师
[10101200,101012008],#蜜獾突击步枪  -  蜜獾-辉耀战甲
[10101300,101013009],#FAMAS突击步枪  -  Famas-初号机 觉醒Ver.
[10101400,101014001],#ACE32突击步枪  -  ACE32-蓝晶绮麟
[10200100,102001038],#UZI冲锋枪  -  UZI-筑梦精灵
[10200200,102002033],#UMP45冲锋枪  -  UMP45-恐龙拽拽
[10200300,102003024],#Vector冲锋枪  -  Vector-环太平洋
[10200400,102004018],#汤姆逊冲锋枪  -  汤姆逊-怪笑疯兔
[10200500,102005016],#野牛冲锋枪  -  野牛-流星咚咚
[10200700,102007002],#MP5K冲锋枪  -  MP5K-众神之王
[10200800,102008009],#AKS-74U冲锋枪  -  AKS-74U-信仰神谕
[10200900,102009001],#JS9冲锋枪  -  JS9-蓝晶绮麟
[10210500,102105016],#P90冲锋枪  -  P90-仙履奇缘
[10300100,103001028],#Kar98K狙击枪  -  Kar98K-伏魔团
[10300200,103002046],#M24狙击枪  -  M24-魔法神域
[10300300,103003028],#AWM狙击枪  -  AWM-平天焚空
[10300400,103004013],#SKS射手步枪  -  SKS-诡面斩
[10300500,103005017],#VSS射手步枪  -  VSS-烈焰拳霸
[10300600,103006007],#Mini14射手步枪  -  Mini14-星际漫游
[10300700,103007034],#Mk14射手步枪  -  Mk14-盛世惊鸿
[10300800,103008011],#Win94狙击枪  -  Win94-拳皇·狂花道
[10300900,103009011],#SLR射手步枪  -  SLR-月影鸳鸯
[10301000,103010008],#QBU射手步枪  -  QBU-全功率超战
[10301100,103011012],#莫辛纳甘狙击枪  -  莫辛纳甘-未来领航者
[10301200,103012015],#AMR狙击枪  -  AMR-鸢尾晶梦
[10301300,103013005],#M417射手步枪  -  M417-第五大道
[10301400,103014005],#MK20-H射手步枪  -  MK20-H-海螺星光
[10301500,103015025],#M200狙击枪  -  M200-梦海之灵
[10301600,103016007],#SVD狙击枪  -  SVD-月影灵韵
[10310000,103100008],#MK12射手步枪  -  MK12-金蛇镇世
[10400100,104001001],#S686霰弹枪  -  S686-幽冥伯爵
[10400200,104002031],#S1897霰弹枪  -  S1897-蓝晶绮麟
[10400300,104003002],#S12K霰弹枪  -  S12K-幻影战神
[10400400,104004028],#DBS霰弹枪  -  DBS-幻影飞狐
[10400500,104005008],#AA12-G霰弹枪  -  AA12-G-焰舞炽心
[10410000,104100007],#SPAS-12霰弹枪  -  SPAS-12-音爆索尼克
[10500100,105001028],#M249轻机枪  -  M249-绒雪飘舞
[10500200,105002037],#DP-28轻机枪  -  DP-28-金蝉行者
[10501000,105010004],#MG3轻机枪  -  MG3-洛神天依
[10501200,105012016],#PKM轻机枪  -  PKM-江南烟雨
[10501300,105013003],#MG-36轻机枪  -  MG-36-幻梦之森
[10600100,106001007],#P92手枪  -  P92-尼罗河传说
[10600200,106002007],#P1911手枪  -  P1911-创世·救赎
[10600300,106003006],#R1895手枪  -  R1895-雏菊兔兔
[10600400,106004003],#P18C手枪  -  P18C-龙虾霸霸
[10600500,106005001],#R45手枪  -  R45-拳皇·狂花道
[10600600,106006004],#短管霰弹枪  -  短管霰弹-竹节火铳
[10600800,106010010],#蝎式手枪  -  沙漠之鹰-羲和光序
[10601000,106010004],#沙漠之鹰手枪  -  沙漠之鹰-全功率超战
[10601100,106011008],#TMP-9手枪  -  TMP-9-幽焰骑士
[10700100,107001003],#十字弩  -  十字弩-异域银装
[10700600,107006001],#战术弩  -  战术弩-江南烟雨
[10700700,107007013],#爆炸猎弓  -  爆炸猎弓-拳皇·狂花道
[10700800,107008004],#燃点复合弓  -  燃点复合弓-时空协奏
[10701000,107010004],#突击盾牌  -  突击盾牌-初号机 觉醒Ver.
[10800100,108001015],#大砍刀  -  大砍刀-盛世惊鸿
[10800200,108002021],#撬棍  -  撬棍-炽纹蛇影
[10800300,108001016],#镰刀  -  大砍刀-鬼刀
[10800400,108004096],#平底锅  -  平底锅-时空协奏
[20300600,100203703],#M16A4机械瞄具  -  M16A4-晶梦幻蝶(机瞄)
[20300900,100602203],#AUG机械瞄具  -  AUG-星之彼岸(机瞄)
[20301000,200302203],#Vector机械瞄具  -  Vector-环太平洋(机瞄)
[20302500,210501603],#P90默认瞄准镜  -  P90-仙履奇缘(机瞄)
[20302600,301300303],#M417机械瞄具  -  M417-第五大道(机瞄)
[20302700,101200603],#蜜獾默认瞄具  -  蜜獾-辉耀战甲(机瞄)
[20500600,200302204],#Vector默认枪托  -  Vector-环太平洋(枪托)
[20500700,100203704],#M16A4默认枪托  -  M16A4-晶梦幻蝶(枪托)
[20501000,301300304],#M417默认枪托  -  M417-第五大道(枪托)
[28100500,100501801],#GROZA默认枪口  -  GROZA-香水柠檬(枪口)
[28100800,100806801],#M762突击步枪默认枪口  -  M762-鬼刀(枪口)
[28101400,1004021],#M200默认枪口  -  梦海之灵-检视动画
[29100100,100101702],#AKM突击步枪默认弹匣  -  AKM-甜心宝贝(弹匣)
[29100300,100302002],#SCAR-L突击步枪默认弹匣  -  SCAR-L-梦幻火箭(弹匣)
[29100500,100501802],#GROZA突击步枪默认弹匣  -  GROZA-香水柠檬(弹匣)
[29100600,1004017],#AUG突击步枪默认弹匣  - 星梦奇缘-检视动画
[29100800,100806802],#M762突击步枪默认弹匣  -  M762-鬼刀(弹匣)
[29100600,100605002],#AUG突击步枪默认弹匣  -  AUG-星梦奇缘(弹匣)
[20300900,100605303],#AUG机械瞄具  -  AUG-星梦奇缘(机瞄)
[29210500,905503],#P90冲锋枪默认弹匣  -  仙履奇缘-击杀击中特效
[330100100,330101900],#buggy沙滩车(黑)  -  Formula E Gen2(巅峰兰)
[330100200,330100900],#buggy沙滩车(黄)  -  合金龙骨（蓝）
[330100300,330100800],#buggy沙滩车(棕迷彩)  -  合金龙骨(红)
[501001,501001009],#背包(1级)  -  萌熊伴侣背包(1级)
[501002,501002009],#背包(2级)  -  萌熊伴侣背包(2级)
[501003,501003009],#背包(3级)  -  萌熊伴侣背包(3级)
[501004,501001010],#背包(1级)  -  酷熊伴侣背包(1级)
[501005,501002010],#背包(2级)  -  酷熊伴侣背包(2级)
[501006,501003010],#背包(3级)  -  酷熊伴侣背包(3级)
[502001,502001012],#摩托车头盔(1级)  -  国宝胖达头盔(1级)
[502002,502002012],#军用头盔(2级)  -  国宝胖达头盔(2级)
[502003,502003012],#特种部队头盔(3级)  -  国宝胖达头盔(3级)
[502004,502001007],#摩托车头盔(1级)  -  甜蜜菠萝头盔(1级)
[502005,502002007],#军用头盔(2级)  -  甜蜜菠萝头盔(2级)
[502006,502003007],#特种部队头盔(3级)->甜蜜菠萝头盔(3级)
[330100100,330100800],#buggy沙滩车(黑), 合金龙骨（红）
[330100200,330100900],#buggy沙滩车(黄), 合金龙骨（蓝)
[330100300,330101000],#buggy沙滩车(棕迷彩), 合金龙骨（绿）
[330100400,330101200],#buggy沙滩车(红黑), 灵鼠银迹
[330100500,330101500],#buggy沙滩车(灰迷彩), 焰龙咆哮
[330100600,330101600],#buggy沙滩车(蓝), 海龙奔腾
[330200100,330401000],#布篷UAZ越野车, 特斯拉Model X(奇幻紫)
[330300100,330401300],#敞篷UAZ越野车, 兰博基尼URUS(炫光金)
[330400100,330405100],#UAZ越野车, 宝马X6 M(脉冲绿)
[330401400,331100100],#兰博基尼URUS(尊享铂), 无篷皮卡(黑)
[330403000,331000100],#玛莎拉蒂Grecale(幻星粉), 带篷皮卡(黑)
[330404200,331100200],#仰望U8(龙石绿), 无篷皮卡(蓝)
[330600100,330604600],#Dacia轿车(蓝), 宝马M4(灿阳金)
[330600200,330602900],#Dacia轿车(红), 玛莎拉蒂Quattroporte(幻星粉)
[330600300,330604300],#Dacia轿车(白), 星河领航(炫晶粉)
[330603000,331200100],#永恒黄蜂, Mirado跑车(黄)
[330603300,334800100],#宾利飞驰(皇家紫), 旅行车
[330604100,331300100],#星河领航(磐石银), Mirado敞篷跑车(黄)
[330800100,330802200],#双人摩托(黑), 盛世惊鸿摩托车
[330800200,330801700],#双人摩托(棕), 疾风龙骑
[330900100,330900300],#三人摩托(黑), 鬼马风驰
[330900200,330900400],#三人摩托(棕), 拉轰鸭鸭车
[331400100,331400400],#罗尼皮卡(白), 特斯拉Cybertruck(极昼黑)
[331400200,331400500],#罗尼皮卡(蓝), 特斯拉Cybertruck(荒芜蓝)
[331400300,331400600],#罗尼皮卡(绿), 特斯拉Cybertruck(镭光铂)
[331500100,331500500],#小型摩托车(蓝), 小牛NX
[332500100,332500200],#PG-117快艇, 快艇-塞莎KL27(深潜蓝)
[333600100,333605200],#2座跑车CoupeRB, KKKP3
[334900100,334900500],#4座敞篷跑车, 宾利欧陆GT敞篷(深空蓝)
[335000100,335000900],#马, 护世瑞兽
[335000200,335000700],#马, 星梦玉骢
[335000300,335001000],#马, 晶梦灵驹
[335100100,335100600],#拉力赛车(黑), 糖心拉力赛车(炫动紫)
[335100300,335100700],#拉力赛车(黑), 羁绊之心
[403209,413956],#拉力赛车(黑), 羁绊之心
[405044,411276],#拉力赛车(黑), 羁绊之心
[503001,413496],#1级甲, 赵云1
[503002,413497],#2级甲, 赵云2
[503003,413498]#3级甲, 赵云3
]

    